# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.Mish(0.1)]],  # 0-P1/2  
  
   #csp-cam
   [-1, 1, Conv, [64, 3, 2, None, 1, nn.Mish(0.1)]],  # 1-P2/4    

   #top branch   
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],    

   #middle branch 1
   [-3, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],    
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],    

   #middle branch 2
   [-6, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, ConvDilated, [64, 3, 1, 3, 3, 1, nn.Mish(0.1)]],    
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],    

   #middle branch 3
   [-9, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, ConvDilated, [64, 3, 1, 5, 5, 1, nn.Mish(0.1)]],    
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],    

   [[-1, -4, -7, -10, -12], 1, Shortcut, [1]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],    
   #end csp-cam

   [-1, 1, Conv, [32, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [32, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],  # 20 
   
   [-1, 1, MP, []],  # P3/8
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],  # 27
   
   [-1, 1, MP, []],  # P4/16
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],  # 34 
   
   [-1, 1, MP, []],  # P5/32
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None, 1, nn.Mish(0.1)]],  # 41 
  ]

# yolov7-tiny head
head:
   #Start SPPCSP
  [[-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],  # 50 
   #End SPPCSP
  
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [34, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   #Bifpn 1
   [-1, 1, CSE_Blockv3, [256, 16]],   
   
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],  # 61 
  
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [27, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],

   #Bifpn 2
   [-1, 1, CSE_Blockv3, [128, 16]],   
   
   [-1, 1, Conv, [32, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [32, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],  # 72 
   
   [-1, 1, Conv, [128, 3, 2, None, 1, nn.Mish(0.1)]],
   [[-1, 61], 1, Concat, [1]],


   #Bifpn 3
   [-1, 1, CSE_Blockv3, [256, 16]],   
   
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],  # 81 
   
   [-1, 1, Conv, [256, 3, 2, None, 1, nn.Mish(0.1)]],
   [[-1, 50], 1, Concat, [1]],

   #Bifpn 4
   [-1, 1, CSE_Blockv3, [512, 16]],   
   
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],  # 90 
      
   [72, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [81, 1, Conv, [128, 3, 1, None, 1, nn.Mish(0.1)]],
   [90, 1, Conv, [256, 3, 1, None, 1, nn.Mish(0.1)]],

   [[91,92,93], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
